Tekla Open API Reference for Tekla Structures 2025
CircleAttributes Constructor
Overload List
Name | Description
Circle.CircleAttributes()
 Creates a new default circle attributes instance that loads standard attributes.
Circle.CircleAttributes(String)
 Creates a new circle attributes instance that loads the specified attributes.
Top
See Also
Reference
Circle.CircleAttributes Class
Tekla.Structures.Drawing Namespace